IDENTIFICATION DIVISION.
PROGRAM-ID. CHANWIT-COBOL-FAAS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME PIC X(100) VALUE SPACES.

PROCEDURE DIVISION.
    ACCEPT NAME FROM SYSIN
    DISPLAY '{"message": "COBOL v2 Hello ' TRIM(NAME) '"}'.
    STOP RUN.
